Revit 2018 API
AnalysisDisplayStyleVectorArrowheadScale Enumeration
 Defines arrow head scaling for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum AnalysisDisplayStyleVectorArrowheadScale
Visual Basic
Public Enumeration AnalysisDisplayStyleVectorArrowheadScale
Visual C++
public enum class AnalysisDisplayStyleVectorArrowheadScale
Members
Member name | Description
NoScaling
Length5Percent
Length10Percent
Length15Percent
Length20Percent
See Also
Autodesk.Revit.DB.Analysis Namespace